#include <iostream>

/*Задание 3. Проверка на чётное число
Что нужно сделать
Напишите программу, которая проверяет, чётное ли число ввел пользователь.

Пример: int remainder = x % 2 (вычисляет остаток от деления `x` на 2).

Пример

Введите число: 28
-----Проверяем-----
Число 28 — чётное

Советы и рекомендации
Для проверки чётности используйте оператор %. Он вычисляет остаток от деления двух чисел.
Не забудьте про отрицательные числа.*/

int main() {
    int number;
    std::cout << "Enter the number: ";
    std::cin >> number;

    
}
